app/Models/BazzetingModel.php

SELECT *
FROM `v_refunitkerja`
WHERE concat(tkpem,kode1) = '2174'
SELECT *
FROM `v_refkomponen`
---
    public function getOPD($kdkomp=null)
    {
        $db      = \Config\Database::connect();
        if($kdkomp != null){
            $builder = $db->table('v_refunitkerja');
            $query = $builder->getWhere(['concat(tkpem,kode1)' => $kdkomp]);
        }else{
            $builder = $db->table('v_refkomponen');
            $query = $builder->get();